selfservice/src/test/resources/lmng-xml/templmngRequest_20130612-155741821.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:adr="http://www.w3.org/2005/08/addressing" xmlns:sur="http://Surfmarket.CRMProxyService">
  <soap:Header>
      <adr:MessageID>urn:uuid:c12c09ce-a448-4d46-89c5-9a4d460ef418</adr:MessageID>
      <adr:ReplyTo>
         <adr:Address>http://www.w3.org/2005/08/addressing/anonymous</adr:Address>
      </adr:ReplyTo>
      <adr:To s:mustUnderstand="1" xmlns:s="s">https://crmproxypilot.surfmarket.nl/crmservice.svc</adr:To>
      <adr:Action>http://Surfmarket.CRMProxyService/ICrmService/GetData</adr:Action></soap:Header>
  <soap:Body>
    <sur:GetData>
      <sur:InputXml>
        	<fetch version="1.0" output-format="xml-platform" mapping="logical" distinct="true">
  <entity name="lmng_sdnarticle">
    <filter>
      <condition attribute="lmng_sdnarticleid" operator="in">
        <value>{BEB4D447-9FA7-E211-9388-0050569E66E5}</value>

      </condition>
    </filter>
    <link-entity name="lmng_sdnarticle_lmng_product" from="lmng_sdnarticleid" to="lmng_sdnarticleid" visible="false" intersect="true">
      <link-entity name="lmng_product" from="lmng_productid" to="lmng_productid" alias="product">
         <link-entity name="lmng_productvariation" from="lmng_productid" to="lmng_productid" alias="productvariation">
          <attribute name="lmng_productid" />
          <attribute name="lmng_licensemodel"/>
          <link-entity name="lmng_licenseagreement" from="lmng_productvariationid" to="lmng_productvariationid" alias="license" >
            <attribute name="lmng_number"/>
            <attribute name="lmng_validfrom"/>
            <attribute name="lmng_validto"/>
            <attribute name="lmng_organisationid"/>
            <filter type="and">
              <condition attribute="lmng_validfrom" operator="on-or-before" value="2013-06-12" />
              <condition attribute="lmng_validto" operator="on-or-after" value="2013-06-12" />
              <condition attribute="statuscode" operator="eq" value="4"/>
                          <condition attribute="lmng_organisationid" operator="eq" value="{837326CA-1A10-DC11-A6C7-0019B9DE3AA4}" />
              

            </filter>
          </link-entity>
        </link-entity>
      </link-entity>
    </link-entity>
  </entity>
</fetch>

      </sur:InputXml>
    </sur:GetData>
  </soap:Body>
</soap:Envelope>
